cf/Documents/КорректировкаДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаСчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаСчет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоПартнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/КорректировкаДС/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + ";
	
	// ДЕНЕЖНЫЕ СРЕДСТВА
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	КассаСчет			КАК Касса,
	|	Сумма
	|ИЗ
	|	Документ.КорректировкаДС.Состав
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ОБОРОТЫ ДЕНЕЖНЫХ СРЕДСТВ	
	
	|ВЫБРАТЬ
	|	&Период		КАК Период,
	|	КассаСчет	КАК КассаСчет,
	|	Подразделение,
	|	Отдел,
	|	Отдел КАК ЦФУ,
	|	ФизЛицоПартнер,
	|	СтатьяДДС,
	|	Сумма		КАК Сумма,
	|	Сумма		КАК СуммаУпр   
	|ИЗ
	|	Документ.КорректировкаДС.Состав
	|ГДЕ
	|	Ссылка = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	ПараметрыСистемы = КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить());
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		ПараметрыСистемы);
	ДополнительныеСвойства.Вставить("ДенежныеСредства", 		Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыДенежныхСредств", 	Пакет[2].Выгрузить());
	
КонецПроцедуры
